<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Onyx client for MacOS 10.110 and builds a .pkg</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.pkg.Onyx1010</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Onyx</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.download.Onyx1010</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
				<key>path_list</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>path_list</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
        </dict>
    </array>
</dict>
</plist>