<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest macOS drivers for Evolis Dualys2 Printer and installs it.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.install.EvolisDualys2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EvolisDualys2</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.download.EvolisDualys2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*</string>
  			</dict>
        </dict>
    </array>
</dict>
</plist>