<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest MakeMKV BETA version for macOS.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.download.MakeMKV</string>
	<key>Comment</key>
	<string>Thanks so much to Eric Holtam for his regex help</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakeMKV</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.makemkv.com/download/</string>
                <key>re_pattern</key>
                <string>(download\/makemkv_v[\d.]*_osx\.dmg)</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.makemkv.com/%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
