<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest MusicBrainz Picard software for macOS. Note: Code signature verification unavailable, as app is not currently signed.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.download.MusicBrainzPicard</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MusicBrainzPicard</string>
    </dict>
	<key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
		<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://picard.musicbrainz.org/downloads/</string>
				<key>re_pattern</key>
				<string>(MusicBrainz-Picard-[\d.]*dmg)</string>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>ftp://ftp.musicbrainz.org/pub/musicbrainz/picard/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>