<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Tom Tom My Sports and imports it into a Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.munki.TomTom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>Tom Tom MySports</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The TomTom MySports Connect application allows you to connect your TomTom Sports Watches to the internet and the rest of the world. Use the TomTom MySports website to manage your activities. Easily review your progress over time thanks to the graphical activity dashboard. You can replay your activity on the map and analyze specific route segments. Set up training sessions too!</string>
			<key>display_name</key>
			<string>Tom Tom MySports</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>Apps</string>
			<key>developer</key>
			<string>Garmin</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.tallfunnyjew.pkg.TomTom</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
