<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the most current TomTom MySports pkg, then extracts the version info. NOTE: as the payload pkg and the app name are different, I'm using two inputs at the top of this recipe and then calling them in their respective processors.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.pkg.TomTom</string>
 	<key>Input</key>
    <dict>
        <key>PAYLOADNAME</key>
        <string>ttfa</string>
        <key>APPNAME</key>
        <string>TomTom MySports Connect</string>
    </dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.tallfunnyjew.download.TomTom</string>
	<key>Process</key>
	<array>
        <dict>
	    <key>Comment</key>
	    <string>This processor grabs the pkg from inside the downloaded DMG, creates an "unpack" directory in the Cache folder and unpacks the pkg into that directory.</string>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
	    <string>This processor creates a "payload" directory in the Cache folder and unpacks the payload from the flatpkg into that directory. Here we call the Payload Name input variable from top of recipe.</string>
	    <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/%PAYLOADNAME%.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
        </dict>            
        <dict>
            <key>Comment</key>
	    <string>This processor grabs the version # from the info.plist inside the App bundle. Here we call the AppName input variable from top of recipe.</string>
	    <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/%APPNAME%.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
	    <string>This processor calls App Name and version & renames the App based on those.</string>
	    <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%APPNAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
		<key>Comment</key>
		<string>This processor deletes the "unpack" and "payload" directories we just created.</string>
		<key>Processor</key>
		<string>PathDeleter</string>
		<key>Arguments</key>
		<dict>
			<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
		</dict> 	
	</array>
</dict>
</plist>
