<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the VERY latest VLC available for mac OS.
    
    NOTE: as VLAN DOESN'T update their sparkle feed ASAP, my recipe checks the VLAN website instead.
    This allows downloads of the most recent releases as soon as they're available.
    For more info, check (https://github.com/autopkg/recipes/issues/211)</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.download.VLC-asap</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VLC-asap</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.videolan.org/vlc/</string>
                <key>re_pattern</key>
                <string>([\d.]*\/macosx\/vlc-[\d.]*.dmg)</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<string>https://get.videolan.org/vlc/%match%</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/VLC.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "org.videolan.vlc" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "75GAHG3SZQ")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
