<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Onyx for MacOS 10.11 El Capitan and builds a PKG.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.pkg.Onyx1011</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Onyx</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.download.Onyx1011</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
			<string>This processor grabs two pieces of info from the app inside of a downloaded DMG: the version and bundle ID. We just need to tell it where to look for that DMG.</string>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
			<string>This processor creates any directory we'll need in later steps to create a pkg that installs the final product into the correct locations.</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
			<string>This processor copies the App from the download and into the pkg root directory we created in the previous step.</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%app_name%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%app_name%</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
			<string>This processor creates a pkg from the pkg root directory, names the pkg with the app name and version and more. For details, see https://github.com/autopkg/autopkg/blob/master/Code/autopkgserver/autopkgserver.</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
