<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Onyx client for OSX 10.11 and imports it into a Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.munki.Onyx1011</string>
	<key>Input</key>
	<dict>
		<key>APP_DESTINATION</key>
		<string>/Applications/Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>global/apps/Onyx</string>
		<key>NAME</key>
		<string>Onyx11</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>OnyX is a multifunctional utility for OS X. It allows you to verify the startup disk and the structure of its System files, to run miscellaneous tasks of system maintenance, to configure the hidden parameters of the Finder, Dock, Spotlight, and of some of Apple's own applications, to delete caches, to remove a certain number of files and folders that may become cumbersome, and more.
&amp;lt;br&amp;gt;&amp;lt;br&amp;gt;
&amp;lt;img src="https://msu.macdesk.dk/artwork/Onyx11.png"&amp;gt;</string>
			<key>developer</key>
			<string>Titanium</string>
			<key>display_name</key>
			<string>Onyx for OSX 10.11</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.tallfunnyjew.download.Onyx1011</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Comment</key>
			<string>This processor imports the final pkg into the location specified in the INPUT string at top of recipe.</string>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
