<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Onyx client for macOS 10.11, builds a .pkg and then installs it.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.install.Onyx1013</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Onyx</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.pkg.Onyx1011</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>