<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Enigmail openPGP plug-in for Thunderbird</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.download.Enigmail</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Enigmail</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The tallfunnyjew-recipes repository is deprecated and will be archived soon (details: https://github.com/autopkg/tallfunnyjew-recipes/issues/37).</string>
            </dict>
        </dict>
    	<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.enigmail.net/index.php/en/</string>
				<key>re_pattern</key>
				<string>(www\.enigmail\.net\/download\/release\/[\d.]*\/enigmail\-[\d.]*\-sm\+tb.xpi)</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://%match%</string>
            </dict>
        </dict>
<!-- 
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install AVG AntiVirus.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: AVG Technologies CZ, s.r.o. (XSJ59WMJBM)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
 -->
    </array>
</dict>
</plist>
