<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs the latest version of CitrixReceiver for macOS</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.install.CitrixReceiver</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Citrix Receiver</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.download.CitrixReceiver</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
			<key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%/Install Citrix Receiver.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
			<key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>/Applications/Citrix Receiver.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%pathname%</string>
                <key>target</key>
                <string>%pathname%-%version%.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
