<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Citrix Receiver.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.download.CitrixReceiver</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>CitrixReceiver</string>
		</dict>
	<key>MinimumVersion</key>
	<string>0.5.1</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Comment</key>
		<string>This processor permits downloading a URL with variables. Convenient if version numbers are in the name of the download and change over time.</string>
		<key>Arguments</key>
			<dict>
				<key>Comment</key>
				<string>First, call the URL where the download is found.</string>
				<key>url</key>
				<string>http://www.citrix.com/downloads/citrix-receiver.html</string>
				<key>Comment</key>
				<string>Now, use a regular expression pattern to account for variables in the item name.</string>
				<key>re_pattern</key>
				<string>(downloads/citrix-receiver/mac/receiver-for-mac-[0-9][0-9][0-9].html)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.citrix.com/%url%#ctx-dl-eula</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>