<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Citrix Receiver.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.download.CitrixReceiver</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>CitrixReceiver</string>
		</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.citrix.com/downloads/citrix-receiver/mac/receiver-for-mac-latest.html</string>
				<key>re_pattern</key>
				<string>(downloads\.citrix\.com\/[\d]*\/CitrixReceiver\.dmg\?__gda__\=[\w]*)</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install Citrix Receiver.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Citrix Systems, Inc. (KBVSJ83SS9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>