<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Handbrake App for macOS. Note: Code signature verification for Handbrake cannot be done at this time, as the application is not currently signed.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.download.Handbrake</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Handbrake</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://handbrake.fr/downloads.php</string>
				<key>re_pattern</key>
				<string>&gt;Current Version: ([\d\.]+)&lt;</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.handbrake.fr/releases/%version%/HandBrake-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
