<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads and names the latest OS drivers for Evolis Primacy Printer. Thanks to Eric Holtam for syntax help!</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.download.EvolisPrimacy</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EvolisPrimacy</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Comment</key>
			<string>Locate a URL with a changing name. Perfect for software downloads.</string>
			<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://us.evolis.com/drivers-support/drivers-primacy-card-printer</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://us.evolis.com/sites/default/files/atoms/files/evolisprinterdriver-.*?.zip)</string>
			</dict>
        </dict>
        <dict>
			<key>Comment</key>
			<string>Download the file from the URLTextSearch and name it with the 'INPUT' variable from above.</string>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
			<key>Comment</key>
			<string>Unzip the downloaded file.</string>
			<key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Comment</key>
			<string>Capture the name of the unzipped pkg file as a variable</string>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
			<string>Call the variable to get the version number from the info.plist inside the pkg.</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%found_filename%/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
			<string>Rename the pkg with set name and version.</string>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>