<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest version of Skitch version for macOS.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.download.Skitch</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Skitch</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The tallfunnyjew-recipes repository is deprecated and will be archived soon (details: https://github.com/autopkg/tallfunnyjew-recipes/issues/37).</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://evernote.com/products/skitch</string>
                <key>re_pattern</key>
                <string>&lt;release\/Skitch-[\d.]*\.zip&gt;</string>
                <key>result_output_var_name</key>
                <string>version</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://evernote.s3.amazonaws.com/skitch/mac/%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Skitch.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.skitch.skitch" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J8RPQ294UB)</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
