<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ComicLife3 client for macOS and builds a .pkg</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.pkg.ComicLife3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ComicLife3</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.download.ComicLife3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
				<key>app_path</key>
				<string>"%RECIPE_CACHE_DIR%"/%NAME%/Comic Life 3.app</string>
			</dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/Comic Life 3-%version%.pkg</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>				
			</dict>
        </dict>
    </array>
</dict>
</plist>
