<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Garmin Express installer PKG, extracts the version info from the embedded PKG and then copies over and renames the installer. NOTE: as the payload pkg and the app name are different, we use two input variables at the top of this recipe and call them in their respective processors.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.pkg.Garmin</string>
 	<key>Input</key>
    <dict>
        <key>PAYLOADNAME</key>
        <string>temp</string>
        <key>APPNAME</key>
        <string>GarminExpress</string>
    </dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.tallfunnyjew.download.Garmin</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Comment</key>
			<string>This processor grabs the pkg from inside the downloaded DMG, creates an "unpack" directory in the Cache folder and unpacks the pkg into that directory.</string>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
        </dict>
        <dict>
            <key>Comment</key>
			<string>This processor unpacks the "payload" directory inside the embedded pkg found in the flatpkg into a separate folder. Here we call the Payload Name input variable from top of recipe.</string>
			<key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/%PAYLOADNAME%.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
        </dict>            
        <dict>
            <key>Comment</key>
			<string>This processor grabs the version number from the info.plist inside the App bundle. In this case there IS no app bundle so the directory called is missing that part. Here we call the AppName input variable from top of recipe.</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
			<string>Normally this processor renames the installer with both the App Name and version. However, CFBundleGetInfoString in this app already has those data.</string>
			<key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%APPNAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
			<string>This processor just deletes the "unpack" and "payload" directories we just created.</string>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
		</dict>    	  
	</array>
</dict>
</plist>
