<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Garmin Express.app for OSX and imports into a Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.munki.Garmin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Garmin Express</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Garmin</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Garmin Express is a Mac application to help interface with your Garmin Sportswatch.</string>
			<key>display_name</key>
			<string>Garmin Express</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>Apps</string>
			<key>developer</key>
			<string>Nike</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.tallfunnyjew.download.Garmin</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Comment</key>
	    <string>This processor imports the final pkg into the location specified in the INPUT string at top of recipe.</string>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
