<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Nike+ Connect and imports it into a Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.munki.NikePlus</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>Nike+ Connect</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Nike+ Connect is the free software program that uploads data from your Nike+ device to your Nike+ account. The devices that require Nike+ Connect are first-generation Nike+ FuelBand, Nike+ FuelBand SE, Nike+ SportWatch GPS, Nike+ SportBand and Nike+ Sport Sensors for Nike+ Basketball and Nike+ Training.</string>
			<key>display_name</key>
			<string>Nike+ Connect</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>Apps</string>
			<key>developer</key>
			<string>Nike</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.tallfunnyjew.pkg.NikePlus</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
