<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of OpenDNS Updater for macOS creates a pkg.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.tallfunnyjew-recipes.pkg.OpenDNSUpdater</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.opendns.OpenDNS_Updater</string>
		<key>NAME</key>
		<string>OpenDNS Updater</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.tallfunnyjew-recipes.download.OpenDNSUpdater</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/OpenDNS Updater.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
