<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of OpenDNS Updater for macOS</string>
	<key>Identifier</key>
	<string>com.github.autopkg.tallfunnyjew-recipes.download.OpenDNSUpdater</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenDNS Updater</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://opendnsupdate.appspot.com/macupdatecheck/ipupdater/AppCast.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
