<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest macOS drivers for the Evolis Primacy Printer.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.download.EvolisPrimacy</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EvolisPrimacy</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://us.evolis.com/drivers-support/drivers-primacy-card-printer</string>
                <key>re_pattern</key>
                <string>(https:\/\/us\.evolis\.com\/sites\/default\/files\/atoms\/files\/evolisprinterdriver-[\d.]*.pkg_.zip)</string>
                <key>result_output_var_name</key>
				<string>download</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<string>%download%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>