<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Name Mangler Software for macOS.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.download.NameMangler</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NameMangler</string>
        <key>DOWNLOAD_URL</key>
        <string>https://manytricks.com/download/namemangler</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The tallfunnyjew-recipes repository is deprecated and will be archived soon (details: https://github.com/autopkg/tallfunnyjew-recipes/issues/37). Consider switching to the Name Mangler recipes in the homebysix-recipes repository.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Name Mangler.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.manytricks.NameMangler" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = METK467GW2)</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
