<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of KeePassX for macOS, builds a pkg and installs it. Note: Code signature verification for Handbrake cannot be done at this time, as the application is not currently signed.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.install.KeePassX</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KeePassX</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.pkg.KeePassX</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>