<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of KeePassX for macOS. Note: Code signature verification for Handbrake cannot be done at this time, as the application is not currently signed.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.download.KeePassX</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>KeePassX</string>
		</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.keepassx.org/downloads</string>
				<key>re_pattern</key>
				<string>"latest_version"&gt;Latest version: ([\d\.]+)&lt;</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.keepassx.org/releases/%version%/KeePassX-%version%.dmg</string>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
