<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest MakeMKV BETA version for macOS.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.download.MakeMKVbeta</string>
	<key>Comment</key>
	<string>No CodeSig Verification as app is unsigned.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakeMKVbeta</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The tallfunnyjew-recipes repository is deprecated and will be archived soon (details: https://github.com/autopkg/tallfunnyjew-recipes/issues/37).</string>
            </dict>
        </dict>
        <dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.makemkv.com/download/</string>
				<key>re_pattern</key>
				<string>(download\/makemkv_v[\d.]*_osx.dmg)</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.makemkv.com/%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
