<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest VLC client for INTEL Macs and builds a .pkg. Do not use this version of VLC if you're on a newer Mac with Apple/Arm Silicon.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.pkg.VLC-Intel-asap</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VLC</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.download.VLC-Intel-asap</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
        <dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
        </dict>
    </array>
</dict>
</plist>
