<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Moneydance for macOS and builds a .pkg</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.pkg.MoneydanceMac</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Moneydance</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.download.MoneydanceMac</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
			<key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                	<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                	<string>%RECIPE_CACHE_DIR%/payload/</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>