<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest version  of Telegram version for macOS.</string>
	<key>Identifier</key>
	<string>com.github.tallfunnyjew.download.Telegram</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Telegram</string>
		<key>DOWNLOAD_URL</key>
        <string>https://telegram.org/dl/macos</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Telegram.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "ru.keepcoder.Telegram" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6N38VWS5BX")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
