<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs latest Onyx client for MacOS 10.12 Sierra.</string>
    <key>Identifier</key>
    <string>com.github.tallfunnyjew.install.Onyx1012</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_URL</key>
        <string>http://joel.barriere.pagesperso-orange.fr/download/1012/OnyX.dmg</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.tallfunnyjew.download.Onyx1012</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>Onyx.app</string>
                        <key>destination_path</key>
                        <string>/Applications/</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
